[
  {
    "id": 0,
    "name": "Picture of the day - NASA",
    "photo": "/nasaPage1.png",
    "gallery": [
      "/nasaPage1.png",
      "/nasaPage2.png"
    ],
    "summary": "Short description of Project 1.",
    "info": "Et prosjekt for en side som lar deg se dagens bilde fra NASA.",
    "background": "Dette prosjektet er laget for å vise mine ferdigheter med html, css og basic javascript.",
    "development": "Prosjektet tok 2 dager. Jeg satt opp wireframe for å vite hvordan jeg ville det skulle se ut. Egen api-nøkkel ble skaffet fra nasa.gov for å kunne hente ut bilder bakover i tid. Jeg brukte copilot for å lage boilerplates og for å sjekke kode for feil. Git ble brukt for versjonskontroll. ",
    "solution": "Siden er kodet i html og Javascript og stilsatt med css.",
    "symbols": [
      "html5",
      "css3",
      "javascript",
      "github"
    ]
  },
  {
    "id": 1,
    "name": "Havets Skatter",
    "photo": "/havetsSkatterPage1.png",
    "gallery": [
      "/havetsSkatterPage1.png",
      "/havetsSkatterPage2.png",
      "/havetsSkatterPage3.png",
      "/havetsSkatterPage4.png"
    ],
    "summary": "Short description of Project 2.",
    "info": "Et prosjekt for en fiktiv sjømat-restaurant.",
    "background": "I dette prosjektet var oppgaven å lage en nettside for en fiktiv sjømat restaurant. I dette prosjektet var det ingen retningslinjer for UX, så alt har blitt designet av meg. Som du kan se: Det viktigste for meg er funksjonalitet, ikke utseende.",
    "development": "I starten av prosjektet var planen kun å ha frontend med en statisk side som fortalte brukeren om hvor restauranten var og hva den handlet om, samt viste frem menyen, med filter for allergener. \n\nEn ekstra oppgavene var å lage mulighet for å reservere bord, så jeg bestemte meg for å implementere det etter at jeg hadde startet på prosjektet. Jeg satt opp en node server, men  hadde det vært planlagt fra starten, ville jeg brukt next.js",
    "solution": "Prosjektet er laget som en singel-page application hvor brukeren har tilgang til 3 sider. Første side er informasjon om restauranten. Andre siden er menyen med mulighet til å markere allergener for å se hva du kan spise der. Tredje siden er bordbestilling. Denne siden er koblet til serveren hvor bord blir opptatt så andre kan se at du har bestilt. Nå får du kun bekreftelse når du bestiller bord som alert, men dette skulle bli en SMS og e-post på en faktisk fungerende side.",
    "symbols": [
      "html5",
      "css3",
      "javascript",
      "react",
      "nodejs",
      "vite",
      "github"
    ]
  },
  {
    "id": 2,
    "name": "Portfolio side",
    "photo": "/portfolioPage1front.png",
    "gallery": [
      "/portfolioPage1.png",
      "/portfolioPage2.png",
      "/portfolioPage3.png"
    ],
    "summary": "Prosjektet var å lage en portfolio-side hvor jeg kan vise frem hva jeg kan og fortelle litt om meg selv",
    "info": "Et prosjekt for min portofolio side.",
    "background": "Prosjektet ble startet fordi jeg trengte noe å vise til hvor jeg fikk frem min kunnskap om moderne programmering verktøy. Prosjektet er gjort i samarbeid med Eirik Granmorken, hvor han har vært ansvarlig for UX-design, og med meg som eier og programmerer. ",
    "development": "I startfasen lagde Eirik forslag til lay-out. Dette så vi på sammen, hvor jeg ga uttrykk for hva jeg likte og ikke. Gjennom et par runder finpusset han disse skissene til det ble den siden du er på nå. Siden ble så skrevet av meg og Eirik fikk tilgang for å fikse på smått i css. ",
    "solution": "Prosjektet er laget som en singel page application. det er 3 side oppsett. Prosjekter er den eneste som blir gjenbrukt for flere sider. første siden er landingsiden, side 2 prosjekt sidene, fylt fra hvilket prosjekt du trykket på.  side 3 om meg, informasjon om meg Bjarne.",
    "symbols": [
      "html5",
      "css3",
      "javascript",
      "react",
      "vite",
      "github"
    ]
  },
  {
    "id": 3,
    "name": "Orb spill prosjekt",
    "photo": "/portfolioPage1front.png",
    "gallery": [
      "/godot0.png",
      "/godot1.png",
      "/godot2.png"
    ],
    "summary": "Prosjektet om å lage et spill med andre på funkweb",
    "info": "prosjektet for spillet ORB.",
    "background": "Et spill prosjekt som ble startet fordi vi ville lage noe kult ",
    "development": " Started med at vi ble enig om å lage et spill. fikk satt opp Asana prosjekt på funkweb. først var det idé fasen. så startet utvikling av kode og kunst. ",
    "solution": "spillet er laget i Godot engine og skrevet med godotscript. det er et 2d puzzle plattform spill. web versjon finnes her :",
    "link": "https://orbthegame.netlify.app/",
    "symbols": [
      "godot",
      "github"
    ]
  }
]